// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
// GnrlString.h
//
// àÀë∂ÅFMFC
// 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

#pragma once


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
// CStringå^16êiï∂éöóÒÇintÇ÷ïœä∑
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
void dump16ToUint32(CString &Text ,uint32_t &nValue);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
// 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
void uint32ToDump16(CString &Text ,uint32_t nValue ,uint32_t Digits);

